In [5]:
import pandas as pd
employee_payroll = pd.read_csv('/Users/eloisefeng/Desktop/NU/Data Management/Employee_Payroll2.csv')

In [6]:
#1. COUNT: to count all the rows in the table
len(employee_payroll)

424

In [7]:
len(employee_payroll.loc[employee_payroll['Employee_Gender'] == 'M'])

233

In [8]:
#2. SUM: to calculate the sum of all the instances in a column
employee_payroll.Salary.sum()

np.int64(16129600)

In [9]:
#3. MAX: maximum value of an attribute
employee_payroll.loc[employee_payroll['Employee_Gender'] == 'M', 'Salary'].max()
#可以把Salary也放进loc[]，会更简洁，仅需加上引号，不用再加[]

np.int64(433800)

In [10]:
#4. MIN: minimum value of an attribute
employee_payroll.loc[employee_payroll['Employee_Gender'] == 'F', 'Salary'].min()

np.int64(24015)

In [11]:
#5. AVERAGE: to calculate the average of all the instances in a column
employee_payroll.Salary.mean()

np.float64(38041.50943396227)

In [12]:
employee_payroll.Salary.sum() / len(employee_payroll)

np.float64(38041.50943396227)

In [13]:
# BIG BANG THEORY Exercise

# DOWNLOAD THE FILE "bigbangtheory.xlsx" FROM CANVAS
# CONVERT TO A CSV FILE
# LOAD INTO AN R DATAFRAME
bigbang = pd.read_csv('/Users/eloisefeng/Desktop/NU/Data Management/bigbangtheory.csv')
bigbang.info()
bigbang.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      7 non-null      int64
 1   name    7 non-null      object
 2   IQ      7 non-null      int64
 3   gender  7 non-null      object
 4   job     7 non-null      object
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

   id       name   IQ  gender             job
0   1    Sheldon  187    Male       Physicist
1   2        Amy  180  Female  Neurobiologist
2   3    Leonard  173    Male       Physicist
3   4        Raj  178    Male  Astrophysicist
4   5  Bernadett  170  Female  Microbiologist

In [14]:
#1. How many characters are in the cast?  How many female characters?
len(bigbang)

7

In [15]:
len(bigbang.loc[bigbang.gender == 'Female'])

3

In [16]:
#2. What are the occupations of characters?
bigbang.job.unique()

array(['Physicist', 'Neurobiologist', 'Astrophysicist', 'Microbiologist',
       'Engineer', 'Sales Rep'], dtype=object)

In [17]:
#3. What is the average IQ of the cast?
bigbang.IQ.mean()

np.float64(163.28571428571428)

In [18]:
#4. What is the mean IQ of the males?
bigbang.loc[bigbang.gender == 'Male', 'IQ'].mean()

np.float64(174.5)

In [19]:
#5. What is the mean IQ of the biologists?
bigbang.loc[bigbang.job.isin(['Neurobiologist', 'Microbiologist']), 'IQ'].mean()

np.float64(175.0)

In [20]:
# or
bigbang.loc[bigbang.job.str.contains('Neurobiologist|Microbiologist', case=False), 'IQ'].mean()
#注意str.contains()里只有一对引号，所有内容都要写在同一对引号内

np.float64(175.0)

In [21]:
# or
bigbang.loc[bigbang.job.str.contains('biologist', case=False), 'IQ'].mean()
#法2和法3中的case=False都代表不管大小写

np.float64(175.0)

In [22]:
#GROUP BY example

## USING THE BIGBANGTHEORY DATA, DISPLAY THE MEAN IQ BY GENDER, AND JOB
bigbang.groupby('gender')['IQ'].mean().reset_index(name='AvgIQ')
#注意groupby()要放在前面（与sql相反）
#reset_index(name='AvgIQ')给所得列加上列名

   gender       AvgIQ
0  Female  148.333333
1    Male  174.500000

In [23]:
#HAVING example

## USING THE BIGBANGTHEORY DATA, DISPLAY THE MEAN IQ FOR THE OCCUPATIONS WITH AN IQ GREAT THAN 170 
bigbang.groupby('job')['IQ'].mean().reset_index(name='AvgIQ').query('AvgIQ > 170')
#此处可以用query()表示the colomn in current table

              job  AvgIQ
0  Astrophysicist  178.0
3  Neurobiologist  180.0
4       Physicist  180.0

In [24]:
grouped_bigbang = bigbang.groupby('job')['IQ'].mean().reset_index(name='AvgIQ')
grouped_bigbang.loc[grouped_bigbang['AvgIQ'] > 170]
#不能直接在后面加loc[]，因为loc[]会从原表里找叫'AvgIQ'的这一列，然而找不到，所以会报错

              job  AvgIQ
0  Astrophysicist  178.0
3  Neurobiologist  180.0
4       Physicist  180.0

In [25]:
#CASE and INSTR -- POWERPOINT


## WORKSHOP QUESTION
#CONDITIONAL BONUS 
#You need to modify the previous bonus report to conditionally calculate bonuses based on the employee’s job title. 
#Level I employees receive a 5% bonus.
#Level II employees receive a 7% bonus.
#Level III employees receive a 10% bonus.
#Level IV employees receive a 12% bonus.
#All others receive an 8% bonus.
#The Staff table contains all of the information that you need to create this report.
staff = pd.read_csv('/Users/eloisefeng/Desktop/NU/Data Management/Staff.csv')
staff.head(5)

,Employee_ID,Start_Date,End_Date,Job_Title,Salary,Gender,Birth_Date,Emp_Hire_Date,Emp_Term_Date,Manager_ID
0,120101,7/1/2003,12/29/9999,Director,163040,M,8/18/1976,7/1/2003,,120261
1,120102,6/1/1989,12/29/9999,Sales Manager,108255,M,8/11/1969,6/1/1989,,120101
2,120103,1/1/1974,12/29/9999,Sales Manager,87975,M,1/22/1949,1/1/1974,,120101
3,120104,1/1/1981,12/29/9999,Administration Manager,46230,F,5/11/1954,1/1/1981,,120101
4,120105,5/1/1999,12/29/9999,Secretary I,27110,F,12/21/1974,5/1/1999,,120101

In [26]:
def bonus_rate(Job_Title):
    if Job_Title.endswith(' I'): return 0.05  #此处不要直接运算bonus，因为如果在这里写staff['Salary'] * 0.05会把整列所有人的工资都*0.05，而不是当前这一个人的
    elif Job_Title.endswith(' II'): return 0.07
    elif Job_Title.endswith(' III'): return 0.1
    elif Job_Title.endswith(' IV'): return 0.12
    else: return 0.08   # return后面不能有逗号，否则会当成（数值，）返回，而不是纯数字
rates = staff['Job_Title'].apply(bonus_rate)   #用apply()调用函数
staff['Bonus'] = staff['Salary'] * rates
staff[['Job_Title', 'Salary', 'Bonus']]  #简化此处，无需使用loc[]

                  Job_Title  Salary     Bonus
0                  Director  163040  13043.20
1             Sales Manager  108255   8660.40
2             Sales Manager   87975   7038.00
3    Administration Manager   46230   3698.40
4               Secretary I   27110   1355.50
..                      ...     ...       ...
419           Sales Manager   83505   6680.40
420           Sales Manager   84260   6740.80
421           Secretary III   29320   2932.00
422            Secretary II   29145   2040.15
423     Business Analyst II   52930   3705.10

[424 rows x 3 columns]

In [27]:
# or
import numpy as np
conditions = [
    staff['Job_Title'].str.endswith(' I'),  #此处不可以使用loc[]，因为loc[]是筛选出所有符合条件的行，并把这些行（连同所有列）打包成一个新的表格返回
    staff['Job_Title'].str.endswith(' II'),  #可以在endswith里加上na=False，防止null报错
    staff['Job_Title'].str.endswith(' III'),
    staff['Job_Title'].str.endswith(' IV')
]
values = [
    staff['Salary'] * 0.05, 
    staff['Salary'] * 0.07, 
    staff['Salary'] * 0.1, 
    staff['Salary'] * 0.12
]
staff['Bonus'] = np.select(conditions, values, default= staff['Salary'] * 0.08)
staff[['Job_Title', 'Salary', 'Bonus']]

                  Job_Title  Salary     Bonus
0                  Director  163040  13043.20
1             Sales Manager  108255   8660.40
2             Sales Manager   87975   7038.00
3    Administration Manager   46230   3698.40
4               Secretary I   27110   1355.50
..                      ...     ...       ...
419           Sales Manager   83505   6680.40
420           Sales Manager   84260   6740.80
421           Secretary III   29320   2932.00
422            Secretary II   29145   2040.15
423     Business Analyst II   52930   3705.10

[424 rows x 3 columns]

In [38]:
## EXTRA QUESTION
## THE WRITING TEAM HAS DECIDED TO GIVE JOKES TO THE BIG BANG THEORY CHARACTERS BASED ON THEIR JOB.  WRITE A ROUTINE USING "CASE" AND "INSTR" TO ASSIGN THE NUMBER OF JOKES ACCORDING TO THIS RULE:  PHYSICISTS GET 8 JOKES, BIOLOGISTS GET 10 JOKES, EVERYONE ELSE GETS 5 JOKES.
## DISPLAY THE NAME, JOB AND NUMBER OF JOKES
def jokes(job):
    if 'physicist' in job.lower(): return 8
    elif 'biologist' in job.lower(): return 10
    # 当使用.apply(jokes)时，Pandas会把每一行的job传给函数，而普通的字符串没有.contains()，只有in
    else: return 5
bigbang['jokes'] = bigbang['job'].apply(jokes)
bigbang[['name', 'job', 'jokes']]

        name             job  jokes
0    Sheldon       Physicist      8
1        Amy  Neurobiologist     10
2    Leonard       Physicist      8
3        Raj  Astrophysicist      8
4  Bernadett  Microbiologist     10
5     Howard        Engineer      5
6      Penny       Sales Rep      5

In [34]:
# or
jobs = [
    bigbang['job'].str.contains('physicist', case=False),
    bigbang['job'].str.contains('biologist', case=False)
]
jokes = [8, 10]
bigbang['jokes'] = np.select(jobs, jokes, default=5)
bigbang[['name', 'job', 'jokes']]

        name             job  jokes
0    Sheldon       Physicist      8
1        Amy  Neurobiologist     10
2    Leonard       Physicist      8
3        Raj  Astrophysicist      8
4  Bernadett  Microbiologist     10
5     Howard        Engineer      5
6      Penny       Sales Rep      5